АлогистикТест2/src/Documents/алк_ТранспортировкаЗапасов/алк_ТранспортировкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ТранспортировкаЗапасов</name>
  <basedOn>Document.алк_РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОтгрузкиПоЗаказам</registerRecords>
  <registerRecords>AccumulationRegister.алк_ТоварыВПути</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ОтгрузкаРН</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрОтправитель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрПолучатель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспорта</name>
    <type>
      <types>EnumRef.алк_ВидыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Пломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОнЖе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемТаможняДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетОснованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоответствуетОснованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВ_ТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Мультизаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКУчету_ТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопАналитика</name>
    <type>
      <types>CatalogRef.алк_АналитикаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаИДКонтейнеров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоПриВзвешивании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоПриВзвешиванииВПорту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПорученияЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесКонтейнера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВПорту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВПортуДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Задекларирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеттоПриВзвешивании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьИдентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоПорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоПорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизит</name>
    <attributes>
      <name>УпакРеквизит</name>
      <type>
        <types>CatalogRef.алк_Реквизит</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесРеквизита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.алк_РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЗаказ</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ТранспортировкаЗапасов/Forms/ФормаСпискаПортовыйАгент/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПриемкаВПортуКоманда.Видимость = РольДоступна("алк_РаботаВЗакрытомПериоде");
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоНаправлению(); 	
		
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытий

&НаСервере
Процедура УстановитьОтборПоНаправлению()
	
	МассивОтбора = Новый Массив;
	Если ОтборНаправлениеЛесопиление Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Лесопиление);
	КонецЕсли;
	
	Если ОтборНаправлениеОтходы Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Отходы);
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Направление", МассивОтбора, ЗначениеЗаполнено(МассивОтбора));
	
КонецПроцедуры //УстановитьОтборПоНаправлению()

#КонецОбласти


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 

Процедура Конец()
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриемкаВПортуНаСервере(ДокСсылка)
		
	Если Ложь Тогда  	
		ДокСсылка = Документы.алк_ТранспортировкаЗапасов.НайтиПоНомеру("");	
	КонецЕсли; 
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	
	ДокОбъект.ПриемкаВПорту = Не ДокОбъект.ПриемкаВПорту;
	
	ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриемкаВПорту(Команда) 	
	ПриемкаВПортуНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
КонецПроцедуры
